Австралия/src/InformationRegisters/UserSettings/UserSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UserSettings</name>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.UserSettings</types>
    </type>
  </resources>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Setting</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.UserSettings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/BusinessUnitsTypes/BusinessUnitsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BusinessUnitsTypes</name>
  <enumValues>
    <name>Department</name>
  </enumValues>
  <enumValues>
    <name>Warehouse</name>
  </enumValues>
  <enumValues>
    <name>Retail</name>
  </enumValues>
  <enumValues>
    <name>RetailEarningAccounting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/ChartsOfCharacteristicTypes/UserSettings/UserSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>UserSettings</name>
  <type>
    <types>CatalogRef.BusinessUnits</types>
    <types>CatalogRef.PriceTypes</types>
    <types>CatalogRef.WorkOrderStatuses</types>
    <types>EnumRef.StockStatusFilters</types>
    <types>CatalogRef.Products</types>
    <types>CatalogRef.SubcontractorOrderIssuedStatuses</types>
    <types>Boolean</types>
    <types>CatalogRef.SubcontractorOrderReceivedStatuses</types>
    <types>CatalogRef.UOMClassifier</types>
    <types>CatalogRef.PurchaseOrderStatuses</types>
    <types>CatalogRef.SupplierPriceTypes</types>
    <types>CatalogRef.TransferOrderStatuses</types>
    <types>CatalogRef.VATRates</types>
    <types>CatalogRef.PriceLists</types>
    <types>CatalogRef.Companies</types>
    <types>CatalogRef.ProductionOrderStatuses</types>
    <types>CatalogRef.KitOrderStatuses</types>
    <types>EnumRef.ExportPeriodsInMobileApplication</types>
    <types>EnumRef.YesNo</types>
    <types>CatalogRef.EmailAccounts</types>
    <types>CatalogRef.SalesOrderStatuses</types>
    <types>CatalogRef.Employees</types>
    <types>EnumRef.AttributeStationing</types>
    <types>EnumRef.DataImportMethodFromExternalSources</types>
    <types>EnumRef.BalancesOutputMethodInSelection</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Checks</name>
      <description>Checks</description>
      <code>00069</code>
    </items>
    <items>
      <name>MultiplePickSetting</name>
      <description>Customization of selection</description>
      <code>00024</code>
    </items>
    <items>
      <name>EMailSettings</name>
      <description>Email settings</description>
      <code>00041</code>
    </items>
    <items>
      <name>DataImportFromExternalSources</name>
      <description>Import data from external sources</description>
      <code>00044</code>
    </items>
    <items>
      <name>DefaultValuesToBeFilled</name>
      <description>Main values for substitutions to the documents and catalogs</description>
      <code>00001</code>
    </items>
    <items>
      <name>MobileClient</name>
      <description>Mobile client</description>
      <code>00068</code>
    </items>
    <items>
      <name>Packing</name>
      <description>Packing</description>
      <code>00052</code>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Австралия/src/InformationRegisters/UserSettings/Forms/UserConfigurationForm/Module.bsl
// By transferred data create string tree on form
//
// Selection - query sample with data in hierarchy
// ValueTree - value tree items for which strings are created
//
&AtServer
Function AddRowsIntoTree(Selection, ValueTree)
	
	While Selection.Next() Do
		
		NewRowOfSetting = ValueTree.Add();
		FillPropertyValues(NewRowOfSetting, Selection);
		NewRowOfSetting.Value = Selection.Setting.ValueType.AdjustValue(Selection.Value);
		
		RowsOfSelection = Selection.Select(QueryResultIteration.ByGroupsWithHierarchy);
		If RowsOfSelection.Count() > 0 Then
			
			AddRowsIntoTree(RowsOfSelection, NewRowOfSetting.GetItems());
			
		EndIf;
		
	EndDo;
	
EndFunction

// Procedure updates information in the setting table.
//
&AtServer
Procedure FillTree()

	SettingsItems = SettingsTree.GetItems();
	SettingsItems.Clear();

	Query = New Query;
	Query.SetParameter("User", User);
	Query.Text=
	"SELECT
	|	Settings.Parent AS Parent,
	|	Settings.Ref AS Setting,
	|	Settings.IsFolder AS IsFolder,
	|	NOT Settings.IsFolder AS PictureNumber,
	|	CASE
	|		WHEN Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.UseProductsCloneForm)
	|				AND SettingsValue.Value IS NULL
	|			THEN TRUE
	|		ELSE SettingsValue.Value
	|	END AS Value,
	|	Constants.UseSeveralCompanies AS UseSeveralCompanies,
	|	Constants.UseSeveralWarehouses AS UseSeveralWarehouses,
	|	Constants.UseSeveralDepartments AS UseSeveralDepartments
	|FROM
	|	ChartOfCharacteristicTypes.UserSettings AS Settings
	|		LEFT JOIN InformationRegister.UserSettings AS SettingsValue
	|		ON (SettingsValue.Setting = Settings.Ref)
	|			AND (SettingsValue.User = &User),
	|	Constants AS Constants
	|WHERE
	|	NOT Settings.DeletionMark
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.MainCompany)
	|				AND NOT Constants.UseSeveralCompanies)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.MainWarehouse)
	|				AND NOT Constants.UseSeveralWarehouses)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.MainDepartment)
	|				AND NOT Constants.UseSeveralDepartments)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.StatusOfNewSalesOrder)
	|				AND NOT Constants.UseSalesOrderStatuses)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.StatusOfNewTransferOrder)
	|				AND NOT Constants.UseTransferOrderStatuses)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.StatusOfNewPurchaseOrder)
	|				AND NOT Constants.UsePurchaseOrderStatuses)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.StatusOfNewProductionOrder)
	|				AND NOT Constants.UseProductionOrderStatuses)
	|	AND Settings.Parent <> VALUE(ChartOfCharacteristicTypes.UserSettings.MultiplePickSetting)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.UsePerformerSalariesInWorkOrder)
	|				AND NOT Constants.UsePayrollSubsystem)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.UsePerformerSalariesInWorkOrder)
	|				AND NOT Constants.UseWorkOrders)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.UseMaterialsInWorkOrder)
	|				AND NOT Constants.UseWorkOrders)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.UseConsumerMaterialsInWorkOrder)
	|				AND NOT Constants.UseWorkOrders)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.UseProductsInWorkOrder)
	|				AND NOT Constants.UseWorkOrders)
	|	AND NOT(Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.WorkKindPositionInWorkOrder)
	|				AND NOT Constants.UseWorkOrders)
	|	AND NOT Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.DataImportMethodFromExternalSources)
	|	AND NOT Settings.Ref = VALUE(ChartOfCharacteristicTypes.UserSettings.DataImportFromExternalSources)
	|
	|ORDER BY
	|	IsFolder HIERARCHY,
	|	Settings.Description";
	
	Selection = Query.Execute().Select(QueryResultIteration.ByGroupsWithHierarchy);
	
	AddRowsIntoTree(Selection, SettingsItems);
	
EndProcedure

// Procedure writes the setting values into the information register.
//
&AtServer
Procedure UpdateSettings()
	
	RecordSet = InformationRegisters.UserSettings.CreateRecordSet();
	
	RecordSet.Filter.User.Use = True;
	RecordSet.Filter.User.Value      = User;
	
	SettingsGroups = SettingsTree.GetItems();
	For Each SettingsGroup In SettingsGroups Do
		
		SettingsItems = SettingsGroup.GetItems();
		
		For Each SettingsRow In SettingsItems Do
			
			Record = RecordSet.Add();
			
			Record.User = User;
			Record.Setting    = SettingsRow.Setting;
			Record.Value     = SettingsRow.Setting.ValueType.AdjustValue(SettingsRow.Value);
			
		EndDo;
		
	EndDo;
	
	RecordSet.Write();
	
	RefreshReusableValues();
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("User") Then
		
		User = Parameters.User;
		
		If ValueIsFilled(User) Then
			
			MainDepartment = ChartsOfCharacteristicTypes.UserSettings.MainDepartment;
			MainWarehouse = ChartsOfCharacteristicTypes.UserSettings.MainWarehouse;
			
			ChoiceParametersDepartment = Enums.BusinessUnitsTypes.Department;
			
			ChoiceParametersWarehouse = New ValueList;
			ChoiceParametersWarehouse.Add(Enums.BusinessUnitsTypes.Warehouse);
			ChoiceParametersWarehouse.Add(Enums.BusinessUnitsTypes.Retail);
			ChoiceParametersWarehouse.Add(Enums.BusinessUnitsTypes.RetailEarningAccounting);
			
			
			FillTree();
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure OnClose(Exit)
	
	If Exit Then
		Return;
	EndIf;
	
	UpdateSettings();
	
EndProcedure

&AtClient
Procedure SettingsTreeBeforeRowChange(Item, Cancel)
	
	If Item.CurrentData = Undefined OR Item.CurrentData.IsFolder Then
		
		Cancel = True;
		Return;
		
	ElsIf Item.CurrentData.Setting = MainDepartment Then
		
		NewArray = New Array();
		NewArray.Add(New ChoiceParameter("Filter.StructuralUnitType", ChoiceParametersDepartment));
		Items.SettingsTreeValue.ChoiceParameters = New FixedArray(NewArray);;
		
	ElsIf Item.CurrentData.Setting = MainWarehouse Then
		
		NewArray = New Array();
		For Each ItemOfList In ChoiceParametersWarehouse Do
			NewArray.Add(ItemOfList.Value);
		EndDo;		
		ArrayWarehouse = New FixedArray(NewArray);
		NewParameter = New ChoiceParameter("Filter.StructuralUnitType", ArrayWarehouse);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		Items.SettingsTreeValue.ChoiceParameters = New FixedArray(NewArray);
		
	EndIf;
	
EndProcedure
